experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients32_workerthreads32_client1_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      198991 ops,    3334 (avg:    2842) ops/sec, 13.14MB/sec (avg: 11.20MB/sec),  9.63 (avg: 11.25) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2842.64          ---          ---     11.25300     11472.97 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2842.64         0.00         0.00     11.25300     11472.97 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.710         0.00
SET       0.760         0.00
SET       0.840         0.00
SET       0.860         0.00
SET       0.890         0.00
SET       0.920         0.00
SET       0.930         0.00
SET       0.950         0.01
SET       0.990         0.01
SET       1.000         0.01
SET       1.100         0.02
SET       1.200         0.03
SET       1.300         0.04
SET       1.400         0.06
SET       1.500         0.07
SET       1.600         0.08
SET       1.700         0.09
SET       1.800         0.10
SET       1.900         0.12
SET       2.000         0.13
SET       2.100         0.15
SET       2.200         0.17
SET       2.300         0.19
SET       2.400         0.22
SET       2.500         0.24
SET       2.600         0.28
SET       2.700         0.31
SET       2.800         0.35
SET       2.900         0.41
SET       3.000         0.47
SET       3.100         0.54
SET       3.200         0.61
SET       3.300         0.69
SET       3.400         0.76
SET       3.500         0.83
SET       3.600         0.92
SET       3.700         1.01
SET       3.800         1.09
SET       3.900         1.18
SET       4.000         1.27
SET       4.100         1.36
SET       4.200         1.46
SET       4.300         1.57
SET       4.400         1.67
SET       4.500         1.78
SET       4.600         1.88
SET       4.700         2.00
SET       4.800         2.10
SET       4.900         2.20
SET       5.000         2.31
SET       5.100         2.42
SET       5.200         2.54
SET       5.300         2.65
SET       5.400         2.79
SET       5.500         2.92
SET       5.600         3.07
SET       5.700         3.21
SET       5.800         3.38
SET       5.900         3.55
SET       6.000         3.73
SET       6.100         3.91
SET       6.200         4.12
SET       6.300         4.33
SET       6.400         4.56
SET       6.500         4.79
SET       6.600         5.04
SET       6.700         5.31
SET       6.800         5.60
SET       6.900         5.90
SET       7.000         6.25
SET       7.100         6.61
SET       7.200         6.99
SET       7.300         7.40
SET       7.400         7.87
SET       7.500         8.35
SET       7.600         8.89
SET       7.700         9.47
SET       7.800        10.11
SET       7.900        10.74
SET       8.000        11.47
SET       8.100        12.26
SET       8.200        13.05
SET       8.300        13.92
SET       8.400        14.86
SET       8.500        15.85
SET       8.600        16.94
SET       8.700        18.11
SET       8.800        19.36
SET       8.900        20.74
SET       9.000        22.22
SET       9.100        23.90
SET       9.200        25.69
SET       9.300        27.60
SET       9.400        29.69
SET       9.500        31.86
SET       9.600        34.18
SET       9.700        36.59
SET       9.800        39.10
SET       9.900        41.54
SET      10.000        53.18
SET      11.000        65.96
SET      12.000        74.26
SET      13.000        80.62
SET      14.000        85.32
SET      15.000        89.16
SET      16.000        92.27
SET      17.000        94.73
SET      18.000        96.42
SET      19.000        97.58
SET      20.000        98.33
SET      21.000        98.70
SET      22.000        98.93
SET      23.000        99.09
SET      24.000        99.20
SET      25.000        99.27
SET      26.000        99.32
SET      27.000        99.37
SET      28.000        99.42
SET      29.000        99.45
SET      30.000        99.47
SET      31.000        99.49
SET      32.000        99.52
SET      33.000        99.54
SET      34.000        99.55
SET      35.000        99.57
SET      36.000        99.59
SET      37.000        99.61
SET      38.000        99.62
SET      39.000        99.64
SET      40.000        99.67
SET      41.000        99.69
SET      42.000        99.70
SET      43.000        99.72
SET      44.000        99.75
SET      45.000        99.78
SET      46.000        99.81
SET      47.000        99.83
SET      48.000        99.85
SET      49.000        99.86
SET      50.000        99.87
SET      51.000        99.89
SET      52.000        99.90
SET      53.000        99.90
SET      54.000        99.91
SET      55.000        99.92
SET      56.000        99.92
SET      57.000        99.92
SET      58.000        99.93
SET      59.000        99.93
SET      60.000        99.94
SET      61.000        99.95
SET      62.000        99.97
SET      63.000        99.97
SET      64.000        99.97
SET      65.000        99.97
SET      66.000        99.97
SET      67.000        99.98
SET      68.000        99.98
SET      69.000        99.98
SET      70.000        99.98
SET      71.000        99.98
SET      78.000        99.98
SET      81.000        99.98
SET     220.000        99.99
SET     230.000       100.00
SET     240.000       100.00
---
---