experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients4_workerthreads16_client1_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       75769 ops,    1099 (avg:    1082) ops/sec, 4.33MB/sec (avg: 4.27MB/sec),  3.63 (avg:  3.69) msec latency

1         Threads
4         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1082.36          ---          ---      3.69100      4368.45 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1082.36         0.00         0.00      3.69100      4368.45 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.520         0.00
SET       0.540         0.00
SET       0.550         0.00
SET       0.560         0.01
SET       0.570         0.01
SET       0.580         0.02
SET       0.590         0.02
SET       0.600         0.04
SET       0.610         0.06
SET       0.620         0.09
SET       0.630         0.12
SET       0.640         0.18
SET       0.650         0.24
SET       0.660         0.33
SET       0.670         0.42
SET       0.680         0.51
SET       0.690         0.66
SET       0.700         0.83
SET       0.710         1.01
SET       0.720         1.23
SET       0.730         1.48
SET       0.740         1.72
SET       0.750         2.05
SET       0.760         2.40
SET       0.770         2.77
SET       0.780         3.21
SET       0.790         3.66
SET       0.800         4.20
SET       0.810         4.73
SET       0.820         5.29
SET       0.830         5.88
SET       0.840         6.53
SET       0.850         7.14
SET       0.860         7.82
SET       0.870         8.50
SET       0.880         9.16
SET       0.890         9.96
SET       0.900        10.73
SET       0.910        11.51
SET       0.920        12.35
SET       0.930        13.22
SET       0.940        14.06
SET       0.950        14.92
SET       0.960        15.80
SET       0.970        16.69
SET       0.980        17.64
SET       0.990        18.55
SET       1.000        23.38
SET       1.100        31.65
SET       1.200        38.18
SET       1.300        42.88
SET       1.400        46.30
SET       1.500        48.52
SET       1.600        50.06
SET       1.700        51.18
SET       1.800        52.10
SET       1.900        52.84
SET       2.000        53.45
SET       2.100        53.96
SET       2.200        54.41
SET       2.300        54.81
SET       2.400        55.16
SET       2.500        55.44
SET       2.600        55.67
SET       2.700        55.92
SET       2.800        56.14
SET       2.900        56.40
SET       3.000        56.62
SET       3.100        56.88
SET       3.200        57.07
SET       3.300        57.31
SET       3.400        57.55
SET       3.500        57.76
SET       3.600        57.94
SET       3.700        58.14
SET       3.800        58.33
SET       3.900        58.46
SET       4.000        58.69
SET       4.100        58.91
SET       4.200        59.18
SET       4.300        59.48
SET       4.400        59.81
SET       4.500        60.09
SET       4.600        60.41
SET       4.700        60.77
SET       4.800        61.10
SET       4.900        61.43
SET       5.000        61.84
SET       5.100        62.20
SET       5.200        62.60
SET       5.300        63.04
SET       5.400        63.48
SET       5.500        63.94
SET       5.600        64.55
SET       5.700        65.24
SET       5.800        66.01
SET       5.900        66.79
SET       6.000        67.64
SET       6.100        68.63
SET       6.200        69.70
SET       6.300        70.86
SET       6.400        72.15
SET       6.500        73.47
SET       6.600        75.02
SET       6.700        76.57
SET       6.800        78.27
SET       6.900        79.96
SET       7.000        81.72
SET       7.100        83.51
SET       7.200        85.23
SET       7.300        86.90
SET       7.400        88.36
SET       7.500        89.67
SET       7.600        90.81
SET       7.700        91.70
SET       7.800        92.46
SET       7.900        93.15
SET       8.000        93.72
SET       8.100        94.25
SET       8.200        94.67
SET       8.300        95.03
SET       8.400        95.36
SET       8.500        95.61
SET       8.600        95.86
SET       8.700        96.09
SET       8.800        96.33
SET       8.900        96.49
SET       9.000        96.63
SET       9.100        96.80
SET       9.200        96.95
SET       9.300        97.06
SET       9.400        97.23
SET       9.500        97.39
SET       9.600        97.51
SET       9.700        97.60
SET       9.800        97.70
SET       9.900        97.79
SET      10.000        98.28
SET      11.000        98.81
SET      12.000        99.09
SET      13.000        99.31
SET      14.000        99.50
SET      15.000        99.71
SET      16.000        99.82
SET      17.000        99.86
SET      18.000        99.89
SET      19.000        99.93
SET      20.000        99.95
SET      21.000        99.97
SET      22.000        99.98
SET      23.000        99.99
SET      24.000        99.99
SET      26.000        99.99
SET      28.000        99.99
SET      32.000        99.99
SET      54.000       100.00
SET      65.000       100.00
---
---